In [31]:
import pandas as pd
import numpy as np
import ssl
ssl._create_default_https_context = ssl._create_unverified_context
import lxml

## 04.18.2021

In [32]:
movie_df = pd.DataFrame()
movie_df["title"] = ["The Shawshank Redemption", "The Dark Knight", "Schindler's List", "Forrest Gump", "Inception"]
movie_df["imdb_rating"] = [9.3, 9.0, 8.9, 8.8, 8.7]
#print(type(movie_df))
movie_df
#movie_df.loc[1,"title"]

                      title  imdb_rating
0  The Shawshank Redemption          9.3
1           The Dark Knight          9.0
2          Schindler's List          8.9
3              Forrest Gump          8.8
4                 Inception          8.7

In [33]:
print(type(movie_df.index))
print(type(movie_df["title"]))
print(type(movie_df["imdb_rating"])) 
print(movie_df["title"].index)
print(movie_df["title"].values)

<class 'pandas.core.indexes.range.RangeIndex'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
RangeIndex(start=0, stop=5, step=1)
['The Shawshank Redemption' 'The Dark Knight' "Schindler's List"
 'Forrest Gump' 'Inception']

## 04.19.2021

In [34]:
from datetime import date 
from datetime import timedelta
today = date.today()
day_delta = timedelta(days=-2)
data_date = today + day_delta
print(data_date)
print(type(data_date))
data_date_str = date.strftime(data_date, '%m-%d-%Y') 
print(data_date_str)

2021-04-30
<class 'datetime.date'>
04-30-2021

In [35]:
csv_url = "https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_daily_reports/04-22-2021.csv"

In [36]:
from datetime import date 
from datetime import timedelta
from urllib.error import HTTPError

def get_latest_daily_report():
    
    today = date.today()
    day_delta = timedelta(days=1)
    data_date = today

    while True: 
        try:
            data_date_str = date.strftime(data_date, '%m-%d-%Y')
            csv_url = "https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_daily_reports/{}.csv".format(data_date_str)
            daily_report = pd.read_csv(csv_url)
            break
        except HTTPError:
            data_date -= day_delta
    print(today)
    print(data_date_str)
    return daily_report
    

daily_report = get_latest_daily_report()
type(daily_report)

2021-05-02
04-30-2021

pandas.core.frame.DataFrame

In [37]:
daily_report

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Combined_Key,Incident_Rate,Case_Fatality_Ratio
0,NaN,NaN,NaN,Afghanistan,2021-05-01 04:20:47,33.939110,67.709953,59745,2625,53206.0,3914.0,Afghanistan,153.474303,4.393673
1,NaN,NaN,NaN,Albania,2021-05-01 04:20:47,41.153300,20.168300,131085,2394,109338.0,19353.0,Albania,4555.042046,1.826296
2,NaN,NaN,NaN,Algeria,2021-05-01 04:20:47,28.033900,1.659600,122108,3253,85108.0,33747.0,Algeria,278.460879,2.664035
3,NaN,NaN,NaN,Andorra,2021-05-01 04:20:47,42.506300,1.521800,13232,125,12684.0,423.0,Andorra,17125.477254,0.944680
4,NaN,NaN,NaN,Angola,2021-05-01 04:20:47,-11.202700,17.873900,26652,596,23876.0,2180.0,Angola,81.092262,2.236230
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3978,NaN,NaN,NaN,Vietnam,2021-05-01 04:20:47,14.058324,108.277199,2928,35,2516.0,377.0,Vietnam,3.008057,1.195355
3979,NaN,NaN,NaN,West Bank and Gaza,2021-05-01 04:20:47,31.952200,35.233200,296462,3249,272333.0,20880.0,West Bank and Gaza,5811.366883,1.095925
3980,NaN,NaN,NaN,Yemen,2021-05-01 04:20:47,15.552727,48.516388,6317,1226,2751.0,2340.0,Yemen,21.179531,19.407947
3981,NaN,NaN,NaN,Zambia,2021-05-01 04:20:47,-13.133897,27.849332,91586,1251,89933.0,402.0,Zambia,498.184395,1.365929
3982,NaN,NaN,NaN,Zimbabwe,2021-05-01 04:20:47,-19.015438,29.154857,38257,1567,35612.0,1078.0,Zimbabwe,257.398829,4.095982

In [38]:
import sqlite3

conn = sqlite3.connect('covid19.db')   #create a new database
daily_report.to_sql('daily_report', conn, if_exists = 'replace') #replace

In [39]:
sql_query = """
SELECT *
    FROM daily_report
WHERE Country_Region LIKE "%Taiwan%";
"""
pd.read_sql(sql_query, conn)

,index,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Combined_Key,Incident_Rate,Case_Fatality_Ratio
0,643,None,None,None,Taiwan*,2021-05-01 04:20:47,23.7,121.0,1128,12,1053.0,63.0,Taiwan*,4.736158,1.06383

In [40]:
excel_file_path = "Movies-2.xls" 
movie_excel = pd.read_excel(excel_file_path) #import excel file but not working

In [41]:
movie_excel

          Title  Release Year  IMDB Rating
0    Spider Man          2016          8.3
1       Bat Man          2018          9.3
2  Wonder Woman          2018          9.3

In [42]:
def read_movies(csv_file_path):
    movies_from_csv = pd.read_csv(csv_file_path,error_bad_lines=False)
    return movies_from_csv

In [43]:
read_movies('movies.csv')

b'Skipping line 3: expected 3 fields, saw 4\n'

                      title   release_year   imdb_rating
0  The Shawshank Redemption           1994           9.2
1                 Inception           2010           8.7
2              Forrest Gump           1994           8.8

## import json

with open('movie1.json') as json_file:
    movies_from_json = json.load(json_file)         
type(movies_from_json)

In [44]:
request_url = "https://www.imdb.com/chart/top"
html_tables = pd.read_html(request_url)
print(type(html_tables)) 
print(len(html_tables))

<class 'list'>
1

In [45]:
len(html_tables)

1

In [46]:
html_tables[0]

,Unnamed: 0,Rank & Title,IMDb Rating,Your Rating,Unnamed: 4
0,NaN,1. 刺激1995 (1994),9.2,12345678910 NOT YET RELEASED Seen,NaN
1,NaN,2. 教父 (1972),9.1,12345678910 NOT YET RELEASED Seen,NaN
2,NaN,3. 教父第二集 (1974),9.0,12345678910 NOT YET RELEASED Seen,NaN
3,NaN,4. 黑暗騎士 (2008),9.0,12345678910 NOT YET RELEASED Seen,NaN
4,NaN,5. 十二怒漢 (1957),8.9,12345678910 NOT YET RELEASED Seen,NaN
...,...,...,...,...,...
245,NaN,246. Ratsasan (2018),8.0,12345678910 NOT YET RELEASED Seen,NaN
246,NaN,247. 較量 (2013),8.0,12345678910 NOT YET RELEASED Seen,NaN
247,NaN,248. 電影版聲之形 (2016),8.0,12345678910 NOT YET RELEASED Seen,NaN
248,NaN,249. 新世紀福音戰士：AIR/真心為你 (1997),8.0,12345678910 NOT YET RELEASED Seen,NaN
249,NaN,250. 故土 (2004),8.0,12345678910 NOT YET RELEASED Seen,NaN

In [47]:
daily_report[daily_report['Country_Region'] == 'US']

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Combined_Key,Incident_Rate,Case_Fatality_Ratio
652,1001.0,Autauga,Alabama,US,2021-05-01 04:20:47,32.539527,-86.644082,6904,107,NaN,NaN,"Autauga, Alabama, US",12357.479103,1.549826
653,1003.0,Baldwin,Alabama,US,2021-05-01 04:20:47,30.727750,-87.722071,20941,305,NaN,NaN,"Baldwin, Alabama, US",9380.739493,1.456473
654,1005.0,Barbour,Alabama,US,2021-05-01 04:20:47,31.868263,-85.387129,2300,56,NaN,NaN,"Barbour, Alabama, US",9317.021794,2.434783
655,1007.0,Bibb,Alabama,US,2021-05-01 04:20:47,32.996421,-87.125115,2594,63,NaN,NaN,"Bibb, Alabama, US",11583.459855,2.428682
656,1009.0,Blount,Alabama,US,2021-05-01 04:20:47,33.982109,-86.567906,6613,135,NaN,NaN,"Blount, Alabama, US",11436.032235,2.041434
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3924,56039.0,Teton,Wyoming,US,2021-05-01 04:20:47,43.935225,-110.589080,3732,9,NaN,NaN,"Teton, Wyoming, US",15905.216502,0.241158
3925,56041.0,Uinta,Wyoming,US,2021-05-01 04:20:47,41.287818,-110.547578,2183,12,NaN,NaN,"Uinta, Wyoming, US",10793.038663,0.549702
3926,90056.0,Unassigned,Wyoming,US,2021-05-01 04:20:47,NaN,NaN,0,0,NaN,NaN,"Unassigned, Wyoming, US",NaN,NaN
3927,56043.0,Washakie,Wyoming,US,2021-05-01 04:20:47,43.904516,-107.680187,903,26,NaN,NaN,"Washakie, Wyoming, US",11569.506726,2.879291
3928,56045.0,Weston,Wyoming,US,2021-05-01 04:20:47,43.839612,-104.567488,650,5,NaN,NaN,"Weston, Wyoming, US",9383.571532,0.769231

In [48]:
print(daily_report.loc[643, ['Country_Region', 'Confirmed']]) # as Series 
daily_report.loc[[643], ['Country_Region', 'Confirmed']]# as DataFrame

Country_Region    Taiwan*
Confirmed            1128
Name: 643, dtype: object

    Country_Region  Confirmed
643        Taiwan*       1128

In [49]:
print(daily_report.iloc[3388, [3, 7]]) # as Series 
daily_report.iloc[[3388], [3, 7]] # as DataFrame

Country_Region      US
Confirmed         4174
Name: 3388, dtype: object

     Country_Region  Confirmed
3388             US       4174

## 05.01.2021

### Dealing with missing values

- Using isnull or notnull to check if np.NaN exists
- Using dropna to drop rows with np.NaN
- Using fillna to fill np.NaN with specific values

In [50]:
daily_report.head(10)

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Combined_Key,Incident_Rate,Case_Fatality_Ratio
0,NaN,NaN,NaN,Afghanistan,2021-05-01 04:20:47,33.93911,67.709953,59745,2625,53206.0,3914.0,Afghanistan,153.474303,4.393673
1,NaN,NaN,NaN,Albania,2021-05-01 04:20:47,41.15330,20.168300,131085,2394,109338.0,19353.0,Albania,4555.042046,1.826296
2,NaN,NaN,NaN,Algeria,2021-05-01 04:20:47,28.03390,1.659600,122108,3253,85108.0,33747.0,Algeria,278.460879,2.664035
3,NaN,NaN,NaN,Andorra,2021-05-01 04:20:47,42.50630,1.521800,13232,125,12684.0,423.0,Andorra,17125.477254,0.944680
4,NaN,NaN,NaN,Angola,2021-05-01 04:20:47,-11.20270,17.873900,26652,596,23876.0,2180.0,Angola,81.092262,2.236230
5,NaN,NaN,NaN,Antigua and Barbuda,2021-05-01 04:20:47,17.06080,-61.796400,1232,32,1014.0,186.0,Antigua and Barbuda,1258.067151,2.597403
6,NaN,NaN,NaN,Argentina,2021-05-01 04:20:47,-38.41610,-63.616700,2977363,63865,2634306.0,279192.0,Argentina,6587.701767,2.145019
7,NaN,NaN,NaN,Armenia,2021-05-01 04:20:47,40.06910,45.038200,216064,4108,198135.0,13821.0,Armenia,7291.493011,1.901289
8,NaN,NaN,Australian Capital Territory,Australia,2021-05-01 04:20:47,-35.47350,149.012400,124,3,120.0,1.0,"Australian Capital Territory, Australia",28.965195,2.419355
9,NaN,NaN,New South Wales,Australia,2021-05-01 04:20:47,-33.86880,151.209300,5481,54,0.0,5427.0,"New South Wales, Australia",67.516630,0.985222

In [51]:
print(daily_report['Province_State'].size)
print(daily_report['Province_State'].isnull().sum())
print(daily_report['Province_State'].notnull().sum())

3983
171
3812

In [52]:
daily_report[daily_report['Country_Region'] == 'US']
#daily_report.dropna()       #drop any row that has a nan value
#print(daily_report['FIPS'].fillna(0))
# daily_report.dropna(axis=1) #drop any column that has a nan value

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Combined_Key,Incident_Rate,Case_Fatality_Ratio
652,1001.0,Autauga,Alabama,US,2021-05-01 04:20:47,32.539527,-86.644082,6904,107,NaN,NaN,"Autauga, Alabama, US",12357.479103,1.549826
653,1003.0,Baldwin,Alabama,US,2021-05-01 04:20:47,30.727750,-87.722071,20941,305,NaN,NaN,"Baldwin, Alabama, US",9380.739493,1.456473
654,1005.0,Barbour,Alabama,US,2021-05-01 04:20:47,31.868263,-85.387129,2300,56,NaN,NaN,"Barbour, Alabama, US",9317.021794,2.434783
655,1007.0,Bibb,Alabama,US,2021-05-01 04:20:47,32.996421,-87.125115,2594,63,NaN,NaN,"Bibb, Alabama, US",11583.459855,2.428682
656,1009.0,Blount,Alabama,US,2021-05-01 04:20:47,33.982109,-86.567906,6613,135,NaN,NaN,"Blount, Alabama, US",11436.032235,2.041434
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3924,56039.0,Teton,Wyoming,US,2021-05-01 04:20:47,43.935225,-110.589080,3732,9,NaN,NaN,"Teton, Wyoming, US",15905.216502,0.241158
3925,56041.0,Uinta,Wyoming,US,2021-05-01 04:20:47,41.287818,-110.547578,2183,12,NaN,NaN,"Uinta, Wyoming, US",10793.038663,0.549702
3926,90056.0,Unassigned,Wyoming,US,2021-05-01 04:20:47,NaN,NaN,0,0,NaN,NaN,"Unassigned, Wyoming, US",NaN,NaN
3927,56043.0,Washakie,Wyoming,US,2021-05-01 04:20:47,43.904516,-107.680187,903,26,NaN,NaN,"Washakie, Wyoming, US",11569.506726,2.879291
3928,56045.0,Weston,Wyoming,US,2021-05-01 04:20:47,43.839612,-104.567488,650,5,NaN,NaN,"Weston, Wyoming, US",9383.571532,0.769231

In [53]:
daily_report['FIPS'].fillna(1111)

0       1111.0
1       1111.0
2       1111.0
3       1111.0
4       1111.0
         ...
3978    1111.0
3979    1111.0
3980    1111.0
3981    1111.0
3982    1111.0
Name: FIPS, Length: 3983, dtype: float64

### Splitting Strings with str.split as a series

In [54]:
luke_skywalker = "Skywalker, Luke"
luke_skywalker.split(', ')

['Skywalker', 'Luke']

In [55]:
skywalkers = ['Luke Skywalker', 'Anakin Skywalker']
skywalkers

['Luke Skywalker', 'Anakin Skywalker']

In [56]:
split_pattern = ', '
daily_report[daily_report['Country_Region']=='US']['Combined_Key'].str.split(split_pattern)

652        [Autauga, Alabama, US]
653        [Baldwin, Alabama, US]
654        [Barbour, Alabama, US]
655           [Bibb, Alabama, US]
656         [Blount, Alabama, US]
                  ...
3924         [Teton, Wyoming, US]
3925         [Uinta, Wyoming, US]
3926    [Unassigned, Wyoming, US]
3927      [Washakie, Wyoming, US]
3928        [Weston, Wyoming, US]
Name: Combined_Key, Length: 3277, dtype: object

In [57]:
split_pattern = ', '
us_combined_key = daily_report[daily_report['Country_Region']=='US']['Combined_Key']
us_combined_key .str.split(split_pattern, expand=True)  #give the output as a dataframe

               0        1   2
652      Autauga  Alabama  US
653      Baldwin  Alabama  US
654      Barbour  Alabama  US
655         Bibb  Alabama  US
656       Blount  Alabama  US
...          ...      ...  ..
3924       Teton  Wyoming  US
3925       Uinta  Wyoming  US
3926  Unassigned  Wyoming  US
3927    Washakie  Wyoming  US
3928      Weston  Wyoming  US

[3277 rows x 3 columns]

In [58]:
request_url = "https://www.imdb.com/chart/top"
df_list = pd.read_html(request_url)
movies = df_list[0]
no_nan = movies.dropna(axis=1)
print(no_nan)

                       Rank & Title  IMDb Rating  \
0                1.  刺激1995  (1994)          9.2
1                    2.  教父  (1972)          9.1
2                 3.  教父第二集  (1974)          9.0
3                  4.  黑暗騎士  (2008)          9.0
4                  5.  十二怒漢  (1957)          8.9
..                              ...          ...
245          246.  Ratsasan  (2018)          8.0
246                247.  較量  (2013)          8.0
247            248.  電影版聲之形  (2016)          8.0
248  249.  新世紀福音戰士：AIR/真心為你  (1997)          8.0
249                250.  故土  (2004)          8.0

                            Your Rating
0    12345678910 NOT YET RELEASED  Seen
1    12345678910 NOT YET RELEASED  Seen
2    12345678910 NOT YET RELEASED  Seen
3    12345678910 NOT YET RELEASED  Seen
4    12345678910 NOT YET RELEASED  Seen
..                                  ...
245  12345678910 NOT YET RELEASED  Seen
246  12345678910 NOT YET RELEASED  Seen
247  12345678910 NOT YET RELEASED  Seen
248  12345678910 NOT YET RELEASED  Seen
249  12345678910 NOT YET RELEASED  Seen

[250 rows x 3 columns]

## RE Expression 正規表達式

https://docs.python.org/3/library/re.html

In [59]:
titles = movies['Rank & Title'].str.split(expand=True)[1] #split the year and the title
ranks =  movies['Rank & Title'].str.split(expand=True)[0]
ranks = ranks.str.replace(',',' ')  #clear the comma
years = movies['Rank & Title'].str.split(expand=True)[2]
years = years.str.replace('\(|\)','')      #RE Expression
#years.str.replace('(', ' ').str.replace(')', ' ').astype(int)
tidy_movies = pd.DataFrame()
tidy_movies['rank']=ranks
tidy_movies['title']=titles
tidy_movies['year']=years
tidy_movies

<ipython-input-59-ded9540ef138>:5: FutureWarning: The default value of regex will change from True to False in a future version.
  years = years.str.replace('\(|\)','')      #RE Expression

     rank             title  year
0      1.            刺激1995  1994
1      2.                教父  1972
2      3.             教父第二集  1974
3      4.              黑暗騎士  2008
4      5.              十二怒漢  1957
..    ...               ...   ...
245  246.          Ratsasan  2018
246  247.                較量  2013
247  248.            電影版聲之形  2016
248  249.  新世紀福音戰士：AIR/真心為你  1997
249  250.                故土  2004

[250 rows x 3 columns]

### Testing for strings that contain a pattern with str.contains

In [60]:
daily_report[daily_report['Country_Region'].str.contains('land')]['Country_Region'].unique

<bound method Series.unique of 204             Finland
248             Iceland
289             Ireland
385    Marshall Islands
430         Netherlands
431         Netherlands
432         Netherlands
433         Netherlands
434         Netherlands
435         Netherlands
436         Netherlands
437         Netherlands
438         Netherlands
439         Netherlands
440         Netherlands
441         Netherlands
442         Netherlands
443         Netherlands
444         Netherlands
445         Netherlands
446         Netherlands
447         New Zealand
491              Poland
593     Solomon Islands
641         Switzerland
646            Thailand
Name: Country_Region, dtype: object>

### Reshaping dataframes from wide to long format with pd.melt

In [61]:
url = 'https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/archived_data/archived_time_series/time_series_19-covid-Confirmed_archived_0325.csv'
ts_confirmed_global = pd.read_csv(url)
ts_confirmed_global.head()

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,3/14/20,3/15/20,3/16/20,3/17/20,3/18/20,3/19/20,3/20/20,3/21/20,3/22/20,3/23/20
0,NaN,Thailand,15.0000,101.0000,2,3,5,7,8,8,...,82,114,147,177,212,272,322,411,599,599.0
1,NaN,Japan,36.0000,138.0000,2,1,2,2,4,4,...,773,839,825,878,889,924,963,1007,1086,1086.0
2,NaN,Singapore,1.2833,103.8333,0,1,3,3,4,5,...,212,226,243,266,313,345,385,432,455,455.0
3,NaN,Nepal,28.1667,84.2500,0,0,0,1,1,1,...,1,1,1,1,1,1,1,1,2,2.0
4,NaN,Malaysia,2.5000,112.5000,0,0,0,3,4,4,...,238,428,566,673,790,900,1030,1183,1306,1306.0

In [62]:
idVars = ['Province/State', 'Country/Region', 'Lat', 'Long']
ts_confirmed_global_long = pd.melt(ts_confirmed_global,
                                  id_vars=idVars,
                                  var_name='Date',
                                  value_name='Confirmed')
ts_confirmed_global_long

,Province/State,Country/Region,Lat,Long,Date,Confirmed
0,NaN,Thailand,15.0000,101.0000,1/22/20,2.0
1,NaN,Japan,36.0000,138.0000,1/22/20,2.0
2,NaN,Singapore,1.2833,103.8333,1/22/20,0.0
3,NaN,Nepal,28.1667,84.2500,1/22/20,0.0
4,NaN,Malaysia,2.5000,112.5000,1/22/20,0.0
...,...,...,...,...,...,...
31057,NaN,Jersey,49.1900,-2.1100,3/23/20,0.0
31058,NaN,Puerto Rico,18.2000,-66.5000,3/23/20,0.0
31059,NaN,Republic of the Congo,-1.4400,15.5560,3/23/20,0.0
31060,NaN,The Bahamas,24.2500,-76.0000,3/23/20,0.0
31061,NaN,The Gambia,13.4667,-16.6000,3/23/20,0.0

### Merging and Joining DataFrames

In [63]:
left_df = daily_report[daily_report['Country_Region'].isin(['Taiwan*', 'Japan'])]
right_df = ts_confirmed_global_long[ts_confirmed_global_long['Country/Region'].isin(['Taiwan*', 'Korea, South'])]
# default: inner join
pd.merge(left_df, right_df, left_on='Country_Region', right_on='Country/Region')

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat_x,Long_,Confirmed_x,Deaths,Recovered,Active,Combined_Key,Incident_Rate,Case_Fatality_Ratio,Province/State,Country/Region,Lat_y,Long,Date,Confirmed_y
0,NaN,NaN,NaN,Taiwan*,2021-05-01 04:20:47,23.7,121.0,1128,12,1053.0,63.0,Taiwan*,4.736158,1.06383,NaN,Taiwan*,23.7,121.0,1/22/20,1.0
1,NaN,NaN,NaN,Taiwan*,2021-05-01 04:20:47,23.7,121.0,1128,12,1053.0,63.0,Taiwan*,4.736158,1.06383,NaN,Taiwan*,23.7,121.0,1/23/20,1.0
2,NaN,NaN,NaN,Taiwan*,2021-05-01 04:20:47,23.7,121.0,1128,12,1053.0,63.0,Taiwan*,4.736158,1.06383,NaN,Taiwan*,23.7,121.0,1/24/20,3.0
3,NaN,NaN,NaN,Taiwan*,2021-05-01 04:20:47,23.7,121.0,1128,12,1053.0,63.0,Taiwan*,4.736158,1.06383,NaN,Taiwan*,23.7,121.0,1/25/20,3.0
4,NaN,NaN,NaN,Taiwan*,2021-05-01 04:20:47,23.7,121.0,1128,12,1053.0,63.0,Taiwan*,4.736158,1.06383,NaN,Taiwan*,23.7,121.0,1/26/20,4.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
57,NaN,NaN,NaN,Taiwan*,2021-05-01 04:20:47,23.7,121.0,1128,12,1053.0,63.0,Taiwan*,4.736158,1.06383,NaN,Taiwan*,23.7,121.0,3/19/20,108.0
58,NaN,NaN,NaN,Taiwan*,2021-05-01 04:20:47,23.7,121.0,1128,12,1053.0,63.0,Taiwan*,4.736158,1.06383,NaN,Taiwan*,23.7,121.0,3/20/20,135.0
59,NaN,NaN,NaN,Taiwan*,2021-05-01 04:20:47,23.7,121.0,1128,12,1053.0,63.0,Taiwan*,4.736158,1.06383,NaN,Taiwan*,23.7,121.0,3/21/20,153.0
60,NaN,NaN,NaN,Taiwan*,2021-05-01 04:20:47,23.7,121.0,1128,12,1053.0,63.0,Taiwan*,4.736158,1.06383,NaN,Taiwan*,23.7,121.0,3/22/20,169.0
61,NaN,NaN,NaN,Taiwan*,2021-05-01 04:20:47,23.7,121.0,1128,12,1053.0,63.0,Taiwan*,4.736158,1.06383,NaN,Taiwan*,23.7,121.0,3/23/20,169.0

In [64]:
pd.merge(left_df, right_df, left_on='Country_Region', right_on='Country/Region', how='left') #left join

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat_x,Long_,Confirmed_x,Deaths,Recovered,Active,Combined_Key,Incident_Rate,Case_Fatality_Ratio,Province/State,Country/Region,Lat_y,Long,Date,Confirmed_y
0,NaN,NaN,Aichi,Japan,2021-05-01 04:20:47,35.035551,137.211621,33481,620,29105.0,3756.0,"Aichi, Japan",443.325483,1.851797,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,Akita,Japan,2021-05-01 04:20:47,39.748679,140.408228,455,9,368.0,78.0,"Akita, Japan",47.077569,1.978022,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,Aomori,Japan,2021-05-01 04:20:47,40.781541,140.828896,1576,22,1268.0,286.0,"Aomori, Japan",126.447101,1.395939,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,Chiba,Japan,2021-05-01 04:20:47,35.510141,140.198917,33153,621,31179.0,1353.0,"Chiba, Japan",529.652927,1.873134,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,Ehime,Japan,2021-05-01 04:20:47,33.624835,132.856842,2332,40,1897.0,395.0,"Ehime, Japan",174.131861,1.715266,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
106,NaN,NaN,NaN,Taiwan*,2021-05-01 04:20:47,23.700000,121.000000,1128,12,1053.0,63.0,Taiwan*,4.736158,1.063830,NaN,Taiwan*,23.7,121.0,3/19/20,108.0
107,NaN,NaN,NaN,Taiwan*,2021-05-01 04:20:47,23.700000,121.000000,1128,12,1053.0,63.0,Taiwan*,4.736158,1.063830,NaN,Taiwan*,23.7,121.0,3/20/20,135.0
108,NaN,NaN,NaN,Taiwan*,2021-05-01 04:20:47,23.700000,121.000000,1128,12,1053.0,63.0,Taiwan*,4.736158,1.063830,NaN,Taiwan*,23.7,121.0,3/21/20,153.0
109,NaN,NaN,NaN,Taiwan*,2021-05-01 04:20:47,23.700000,121.000000,1128,12,1053.0,63.0,Taiwan*,4.736158,1.063830,NaN,Taiwan*,23.7,121.0,3/22/20,169.0
110,NaN,NaN,NaN,Taiwan*,2021-05-01 04:20:47,23.700000,121.000000,1128,12,1053.0,63.0,Taiwan*,4.736158,1.063830,NaN,Taiwan*,23.7,121.0,3/23/20,169.0

In [65]:
left_df = daily_report[daily_report['Country_Region'].isin(['Taiwan*', 'Japan'])]
right_df = ts_confirmed_global_long[ts_confirmed_global_long['Country/Region'].isin(['Taiwan*', 'Korea, South'])]
left_df = left_df.set_index('Country_Region')
right_df = right_df.set_index('Country/Region')